import logging
from pathlib import Path
from textwrap import dedent

import gigacode
import git

log = logging.getLogger(__name__)


def opsx_apply(data: dict):
    log.info("Реализация задачи")
    prompt = dedent(f"""
    `/opsx:apply` для {data["delta_spec_dir"]}

    Твоя цель - реализовать изменения в коде на основе артефактов из `{data["delta_spec_dir"]}`, действуя как Senior Developer, который идеально мимикрирует под существующий проект.

    # Правила выполнения:
    1. Исследование референсов: Перед тем как писать новый код, изучи смежные, уже существующие файлы в проекте. Твой новый код должен идеально соответствовать текущей кодовой базе по следующим параметрам:
       - Архитектурные паттерны и структура папок.
       - Стиль написания кода (Code Style, именование переменных, функций, классов).
       - Подходы к обработке ошибок (Error Handling) и логированию.
       - Способы написания тестов и моков.
       Пиши код так, будто его написал автор этого репозитория.
    2. Автономное написание кода: Пошагово выполняй задачи из `tasks.md`. Пиши чистый код с обработкой edge-case'ов.
    3. Обратная синхронизация спеки (Двунаправленность): Если в процессе написания кода или изучения референсов ты поймешь, что заложенная в `design.md` архитектура неоптимальна или противоречит сложившимся практикам проекта - самостоятельно измени код лучшим образом И сразу же перепиши соответствующие пункты в `design.md` и `tasks.md`. Действуй без вопросов.
    4. Цикл самоисправления: После написания кода запускай команду сборки/тестирования проекта. Если линтер или тесты выдают ошибки, автономно исправляй код до тех пор, пока всё не станет зелёным.

    Ограничение: Git-коммит (commit) НЕ ДЕЛАЙ.

    # Дополнительно:
    - Номер спринта: `{data["jira_task"]["sprint_version"]}`
    """).strip()

    repo_path = Path(data["sandbox_path"]) / "repo"

    gigacode.run(prompt, repo_path)

    git.commit_all(repo_path, f"impl done. {data['issue_key']}")
    git.push(repo_path, data['branch_name'])
